Revit 2026 API

# DocumentPhases Property

---

Retrieves all of the phases in the document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PhaseArray Phases { get; }
```
```vb
Public ReadOnly Property Phases As PhaseArray
	Get
```
```cpp
public:
property PhaseArray^ Phases {
	PhaseArray^ get ();
}
```
```fsharp
member Phases : PhaseArray with get
```

#### Property Value

PhaseArray

The phases are returned in order from earliest phase to latest phase.

When Revit is running with UI activated, the default created phase for newly created elements is inherited from the phase of the currently active view.

When Revit is running without its UI, such as when Revit runs on Autodesk Forge Design Automation API for Revit, the default phase for newly created elements is the latest phase in the document.

#### Reference

Document Class

Autodesk.Revit.DB Namespace